Revit 2027 API
ThermalAsset.Behavior Property
 Flag indicating whether elements of this material behave isotropically or orthotropically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralBehavior Behavior { get; set; }
Public Property Behavior As StructuralBehavior
	Get
	Set
public:
property StructuralBehavior Behavior {
	StructuralBehavior get ();
	void set (StructuralBehavior value);
}
member Behavior : StructuralBehavior with get, set
Property Value
StructuralBehavior
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace